OdDAI.Repository.writeStream(OdSmartPtr&lt;OdStreamBuf&gt;,System.Boolean)
\details
Writes data from the specified stream buffer to a physical file.
\param pStream      [in] A smart pointer to the output stream buffer object to wtite data.
\param saveLogFile  [in] A flag that determines whether the log file should also be written (if equal to true) or not (if equal to false).
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error code.
\remarks
This method does not support writing to Zip format.

OdDAI.Repository.writeFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
\details
Writes data from the repository object to a physical file.
\param filename     [in] A string that contains the full path to the output file to write data.
\param saveLogFile  [in] A flag that determines whether the log file should also be written (if equal to true) or not (if equal to false).
\returns eOk if the data was successfully written; otherwise, the method returns an appropriate error.

OdDAI.Repository.readStream(OdSmartPtr&lt;OdStreamBuf&gt;)
\details
Reads data from a specified stream buffer.
\param pStream [in] A smart pointer to the stream buffer  object to read data from.
\returns eOk if the data was successfully read; otherwise, the method returns an appropriate error.

OdDAI.Repository.readBuffer(System.SByte!System.Runtime.CompilerServices.IsSignUnspecifiedByte!System.Runtime.CompilerServices.IsConst*)
\details
Creates the repository from a memory buffer that contains STEP Physical File (*.spf) data.
\param spfBuf [in] A char array that contains buffered data of the model in the STEP Physical File representation.
\returns eOk if the data was successfully read; otherwise, the method returns an appropriate error.

OdDAI.Repository.readFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Creates the repository from a specified STEP Physical File (*.spf).
\param fileName [in] A string that contains the file name.
\returns eOk if the data content was successfully read; otherwise, the method returns an appropriate error code.